chat_system_331640009_actor_description=King Mark. Your King.
chat_system_331640009_quest_rek_question=^?^Hmm. Young man, I am the king of Darion, Mark Leonard the Second. I was informed that you are the youth who is applying to be our official Treasure Searcher.<br>But let me ask you, what are your qualifications? This position is too important to entrust the job to the first comer, and indeed you are not the first to apply...
chat_system_331640009_quest_rek_answer_0=^?^Here are the letters of reference from my mentor at the Knight's School.
chat_system_331640009_quest_rek_answer_1=^?^Here are the letters of reference from my mentor in the Knight's School.
chat_system_331640009_snap_rek_question=^?^Oh, so it is you, [player]. Iron Richard told me about quite a talented and promising young man, when I raised the subject of the new Treasure Searcher. I hope you'll be able to handle all your new responsibilities.<br>So it is decided! Of my royal will I, the king of Darion, Mark Leonard the Second, do declare the knight named [player] to be my Royal Treasure Searcher, and confer upon him the title of [rank] and all the regalia which thereto append!
chat_system_331640009_snap_rek_answer_0=^?^I'm happy to serve you, Your Majesty!
chat_system_331640009_demo_question=^?^And now, [player], you are to take up the first task immediately. We shall see if you can manage to find our missing Plugens.<br>Recently, the tax collector was robbed as he was bringing some Plugens to the castle. The crime was committed by a robbers' gang on the eastern road. The robbers escaped, and the guards who were sent to chase them collected only a small part of what was stolen.<br>You shall recover the rest of the loss, all four hundred Plugens - and punish the robbers.<br>[reward]
chat_system_331640009_demo_answer_0=^?^No problem, consider them as good as found.
chat_system_331640009_demo_header_0=^?^Ha-ha... We'll consider as soon as we have something to consider. I can't see even a single Plugen at the moment!
chat_system_331640009_snap_0_question=^?^Reference letters from the Knight's School you say? Ha-ha-ha! You are a better candidate for the position of our court jester...<br>A bowl on your head, and a wheel in your hands! How amusing!
chat_system_331640009_snap_0_answer_0=^?^I truly apologize for my ridiculous appearance, Your Majesty. But truly I have come to you from my mentor, Richard. Please read the letter.
